ru.vsu.netcracker.lab_1/target/classes/persons.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:sch="http://www.lab_3.com/springsoap/gen"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.lab_3.com/springsoap/gen" targetNamespace="http://www.lab_3.com/springsoap/gen">
    <wsdl:types>
        <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://www.lab_3.com/springsoap/gen">

            <xs:element name="getPersonRequest">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element name="name" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>

            <xs:element name="getPersonResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element name="person" type="tns:person" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>

        <xs:complexType name="person">
                <xs:sequence>
                    <xs:element name="id" type="xs:int"/>
                    <xs:element name="firstName" type="xs:string"/>
                    <xs:element name="lastName" type="xs:string"/>
                    <xs:element name="age" type="xs:int"/>
                </xs:sequence>
            </xs:complexType>

        </xs:schema>
    </wsdl:types>
    <wsdl:message name="getPersonResponse">
        <wsdl:part element="tns:getPersonResponse" name="getPersonResponse">
        </wsdl:part>
    </wsdl:message>
    <wsdl:message name="getPersonRequest">
        <wsdl:part element="tns:getPersonRequest" name="getPersonRequest">
        </wsdl:part>
    </wsdl:message>
    <wsdl:portType name="PeoplePort">
        <wsdl:operation name="getPerson">
            <wsdl:input message="tns:getPersonRequest" name="getPersonRequest">
            </wsdl:input>
            <wsdl:output message="tns:getPersonResponse" name="getPersonResponse">
            </wsdl:output>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="PeoplePortSoap11" type="tns:PeoplePort">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="getPerson">
            <soap:operation soapAction="" />
            <wsdl:input name="getPersonRequest">
                <soap:body use="literal" />
            </wsdl:input>
            <wsdl:output name="getPersonResponse">
                <soap:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="PeoplePortService">
        <wsdl:port binding="tns:PeoplePortSoap11" name="PeoplePortSoap11">
            <soap:address location="http://localhost:8080/ws" />
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>